{
  "changelog": {
    "name": "changelog",
    "label": "変更履歴",
    "title": "変更履歴",
    "description": "最新の機能、改善、バグ修正、セキュリティアップデートをご確認ください",
    "items": [
      {
        "version": "v1.3.8",
        "date": "2025-12-02",
        "changes": [
          {
            "type": "feature",
            "items": [
              "Added unified keyboard shortcut support to all main generators (Story, Plot, Poem, Fanfic, Tabbed Fanfic, Book Title) including Generate (⌘⏎ / Ctrl⏎) and Focus Input (⌘F / CtrlF)",
              "Introduced a reusable GeneratorShortcutHints component to display available shortcuts consistently below the primary generate buttons",
              "Enabled auto-save draft support for the main input fields across all core generators (Story, Plot, Poem, Fanfic, Tabbed Fanfic, Book Title), persisting drafts to localStorage per locale and restoring them automatically after refresh or navigation"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "Refined generator button labels to keep them clean while surfacing keyboard shortcuts in a dedicated hint area for better discoverability"
            ]
          }
        ]
      },
      {
        "version": "v1.3.7",
        "date": "2025-12-01",
        "changes": [
          {
            "type": "feature",
            "items": [
              "詩ジェネレーターにストーリー保存機能を追加し、生成完了後ガイダンスとストーリー保存ダイアログを統合しました",
              "コミュニティページ（Story Square）にストーリーの出所（story / fanfic / plot / poem）で絞り込めるソースカテゴリーフィルタータグを追加しました",
              "コミュニティ向けの Story Square ページを新規追加し、公開された AI ストーリーを一覧で閲覧できるようにしました",
              "ユーザーコンソールに「マイストーリー」ページを追加し、保存済みの作品を一か所で管理できるようにしました",
              "創作サマリー（Creation Overview）ページを追加し、作品数・総語数・創作日数・連続日数を一目で確認できるようにしました"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "プロットジェネレーターの Save Story ガイドのレイアウトを調整し、保存用コンテンツを1行にまとめて表示することで、全体の見た目が窮屈にならないよう改善しました",
              "Story Square のソースカテゴリーフィルターに、サポートしているすべてのインターフェース言語で一貫した多言語ラベルを追加しました"
            ]
          },
          {
            "type": "fix",
            "items": [
              "詩ジェネレーターの出力エリアにおける JSX 構造の問題により発生していたビルドおよび実行時エラーを修正しました",
              "Next.js 15 の Route Handler 型チェックによりストーリールートのビルドが失敗していた問題を、動的 API ルートの context 型を緩和することで解消しました"
            ]
          }
        ]
      },
      {
        "version": "v1.3.6",
        "date": "2025-11-29",
        "changes": [
          {
            "type": "feature",
            "items": [
              "NextAuth をベースにした統一ログインシステムを導入し、今後のアカウント機能とパーソナライズの基盤を整備しました"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "ヘッダーのナビゲーションをシンプルにし、独立した「Features」タブを削除して AI ライティングの入口に集約しました"
            ]
          }
        ]
      },
      {
        "version": "v1.3.5",
        "date": "2025-11-28",
        "changes": [
          {
            "type": "feature",
            "items": [
              "初回ユーザーが機能と次のアクションをすばやく理解できるよう、新しいオンボーディングフローと生成完了後のガイダンスを追加しました"
            ]
          },
          {
            "type": "fix",
            "items": [
              "Get Startedセクションのアンカー位置が正しくスクロールしない問題を修正しました"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "サイト全体の読み込みパフォーマンスをさらに最適化し、ファーストビューの表示時間を短縮しました",
              "読み込み進行状況の表示を調整し、より滑らかで正確なフィードバックを提供します",
              "AI Writing Toolsモジュールのパフォーマンスとインタラクションの細部を改善しました",
              "不要なステップを減らし、人間認証フローを簡素化して操作感を向上しました",
              "現在のデザインシステムに合わせてHeroとHeaderエリアのスタイルをブラッシュアップしました"
            ]
          }
        ]
      },
      {
        "version": "v1.3.4",
        "date": "2025-11-23",
        "changes": [
          {
            "type": "feature",
            "items": [
              "Changelogモジュールにロシア語ローカライズを追加しました"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "サイト全体のスタイルを調整し、視覚的一貫性を向上しました",
              "ダークモードの表示を改善して可読性を高めました",
              "主要なUIコンポーネントのダークモード視認性をさらに強化しました"
            ]
          }
        ]
      },
      {
        "version": "v1.3.3",
        "date": "2025-11-19",
        "changes": [
          {
            "type": "feature",
            "items": [
              "包括的なAIライティングツールキットを備えたAIライティングツールモジュールを追加",
              "国際化カバレッジを拡大するロシア語サポートを追加"
            ]
          },
          {
            "type": "fix",
            "items": [
              "ブックタイトルの多言語生成失敗問題を修正",
              "システム安定性を向上させる複数のアラート関連問題を修正",
              "ページナビゲーション体験を向上させるルーティング問題を修正"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "ユーザー体験を向上させるページアクセシビリティを最適化",
              "より良い監視と通知機能でアラートシステムを強化"
            ]
          }
        ]
      },
      {
        "version": "v1.3.2",
        "date": "2025-11-15",
        "changes": [
          {
            "type": "feature",
            "items": [
              "モダンなホバーアニメーションと相互作用を備えたパンくずリストナビゲーションコンポーネントを追加",
              "詩ジェネレーターをグローバルナビゲーション構造とサイトマップに統合"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "直感的なパンくずリストナビゲーションで詩ジェネレーターユーザーエクスペリエンスを強化",
              "詩ジェネレーターの適切なインデックスと検索優先度のため、サイトマップSEOを最適化",
              "ヘッダーとフッターに詩ジェネレーターアクセスポイントを追加してランディングページナビゲーションを更新"
            ]
          }
        ]
      },
      {
        "version": "v1.3.1",
        "date": "2025-11-15",
        "changes": [
          {
            "type": "feature",
            "items": [
              "複数の詩のタイプ（俳句、ソネット、アクロスティック、愛の詩など）をサポートする包括的なAI詩ジェネレーターを追加",
              "AI駆動の文学分析とフィードバックを備えた詩の分析APIを実装",
              "広範なカスタマイズオプションを備えたデュアルモードインターフェース（シンプル/アドバンスド）を作成",
              "ローカルストレージとドロップダウンインターフェースを備えた詩の履歴管理システムを追加",
              "詩ジェネレーターをメインナビゲーションとサイト構造に統合"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "5つの言語（英語、中国語、日本語、韓国語、ドイツ語）での完全な国際化サポートを実装",
              "コードの保守性を向上させるための包括的なTypeScriptタイプ定義を追加",
              "詩ジェネレーターの広範なマーケティング資産とSEO最適化を作成",
              "モードトグル機能と高度なカスタマイズオプションでUIを強化"
            ]
          }
        ]
      },
      {
        "version": "v1.3.0",
        "date": "2025-11-08",
        "changes": [
          {
            "type": "feature",
            "items": [
              "AI駆動のストーリーアウトライン作成機能を備えた包括的なプロットジェネレーター機能を追加",
              "簡単な発見のため、プロットジェネレーターをメインナビゲーションとサイトマップに統合",
              "5つの言語（英語、中国語、日本語、韓国語、ドイツ語）でプロットジェネレーターの多言語サポートを実装",
              "AIプロットジェネレーターの長尾キーワード統合によりSEO最適化を強化",
              "ユーザーエクスペリエンス向上のため、プロットジェネレーターページにパンくずリストナビゲーションを追加"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "検索エンジンの視認性向上のため、プロットジェネレーターのメタデータを最適化",
              "ヘッダーとフッターの両方のAIライティングセクションにプロットジェネレーターを追加し、ナビゲーションの一貫性を強化",
              "説得力のあるマーケティングコピーとプロフェッショナルなプレゼンテーションでプロットジェネレーターUIを改善",
              "サポートされているすべての言語で創造的インスピレーションのための包括的なランダムプロンプトライブラリを追加"
            ]
          }
        ]
      },
      {
        "version": "v1.2.5",
        "date": "2025-11-03",
        "changes": [
          {
            "type": "feature",
            "items": [
              "ファンフィクション生成露レーターに5つの言語対応の多言語出力オプションを追加",
              "688行のプリセット作品ライブラリでファンフィクション機能を大幅に強化、即座のインスピレーションを提供",
              "より良いユーザーナビゲーションのためのパンくずリストナビゲーションコンポーネントを導入",
              "パフォーマンスを向上させ、エラーハンドリングを改善した強化されたファンフィクション生成API",
              "コードの保守性を高めるための包括的なTypeScript型定義を追加"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "改善されたリソース管理によりランディングページの読み込みパフォーマンスを最適化",
              "FAQ2コンポーネントのダークモード表示問題を修正し、視覚的一貫性を向上",
              "ファンフィクションコンポーネントのスタイルとインタラクショ論を強化",
              "複数のコンポーネントのユーザーインターフェースを改善"
            ]
          },
          {
            "type": "fix",
            "items": [
              "ファンフィクションwhatコンポーネントのタイトルスタイル問題を修正",
              "よりクリーンなコードベースのために重複したコンポーネントコードを削除"
            ]
          }
        ]
      },
      {
        "version": "v1.2.4",
        "date": "2025-11-01",
        "changes": [
          {
            "type": "improvement",
            "items": [
              "ファンフィクションストーリージェネレーターのインターフェースを強化、優れた視覚体験とレイアウト配置のためにスタイルを最適化",
              "5つの言語（中国語、英語、日本語、韓国語、德国語）でファンフィクションコンポーネントに完全な国際化サポートを追加",
              "高度なオプションと生成タブのハードコードされた中国語のテキスト問題を修正",
              "優れたユーザーインタラクションのために新しいポップオーバーUIコンポーネントを導入",
              "ステップタブコンポーネントのスタイルとインタラクショ論を改善",
              "スマートレコメンデーションコンポーネントを強化し、レコメンデーション精度を向上"
            ]
          },
          {
            "type": "feature",
            "items": [
              "コードの保守性を向上させるため、ファンフィクション生成コンポーネントに包括的なTypeScript型定義を追加",
              "すべてのスタイル調整の詳細を記録するFANFIC_WIDTH_ALIGNMENT_REPORT.mdドキュメントを作成"
            ]
          }
        ]
      },
      {
        "version": "v1.2.3",
        "date": "2025-10-25",
        "changes": [
          {
            "type": "feature",
            "items": [
              "カスタマイズ可能なジャンル、トーン、スタイルオプションを備えたAI駆動のブックタイトルジェネレーターを追加",
              "5つの言語（英語、中国語、日本語、韓国語、ドイツ語）での完全な国際化サポートを実装",
              "モダンなUIデザインとユーザーエクスペリエンスを備えた専用ブックタイトルジェネレーターページを作成",
              "複数のパラメータとSEO最適化を備えた包括的なタイトル生成APIを追加",
              "簡単な発見のため、ブックタイトルジェネレーターをメインナビゲーションとサイトマップに統合"
            ]
          }
        ]
      },
      {
        "version": "v1.2.2",
        "date": "2025-10-25",
        "changes": [
          {
            "type": "feature",
            "items": [
              "ストーリージェネレーターに独立した出力言語選択機能を追加",
              "12の主要言語をサポート：英語、中国語、日本語、韓国語、スペイン語、フランス語、ドイツ語、ポルトガル語、ロシア語、アラビア語、ヒンディー語、イタリア語",
              "言語セレクターは「クイック追加」セクションの下に配置され、直感的な絵文字とバイリンガル表示を提供",
              "ユーザーはウェブサイトインターフェースとは異なるストーリー出力言語を選択可能",
              "すべてのインターフェーステキストをカバーする完全な多言語翻訳サポート"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "新しいoutputLanguageフィールドでAPIパラメータ渡しを最適化",
              "クロージャー問題を回避するための状態管理を改善",
              "TypeScript型定義を拡張して型安全性を強化",
              "既存のデザインシステムとの一貫性を維持"
            ]
          }
        ]
      },
      {
        "version": "v1.2.1",
        "date": "2025-10-20",
        "changes": [
          {
            "type": "fix",
            "items": [
              "誤ったルーターを使用して言語状態が失われる言語スイッチャーの問題を修正",
              "言語切り替えコンポーネントがnext-intlのi18n対応ルーターを使用するようになり、言語切り替え後にリンクをクリックしても言語状態が維持されるようになりました"
            ]
          }
        ]
      },
      {
        "version": "v1.2.0",
        "date": "2025-10-18",
        "changes": [
          {
            "type": "feature",
            "items": [
              "AI生成ストーリーの例を表示するストーリーショーケースページを追加",
              "完全な国際化サポートを実装（中国語、英語、日本語、韓国語、ドイツ語）",
              "タイムラインスタイル表示、バージョン追跡、更新分類（機能/修正/改善/セキュリティ）、多言語サポートを含む完全な変更履歴モジュールを追加し、FooterとSitemapにエントリを追加"
            ]
          },
          {
            "type": "fix",
            "items": [
              "言語切り替え後に一部のページが英語のままになる問題を修正",
              "ストーリー詳細ページのUIテキスト国際化を修正"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "静的生成によりページ読み込みパフォーマンスを改善",
              "モバイルレスポンシブレイアウトの体験を向上"
            ]
          }
        ]
      },
      {
        "version": "v1.1.0",
        "date": "2025-10-15",
        "changes": [
          {
            "type": "feature",
            "items": [
              "コアAIストーリー生成機能をリリース",
              "複数のストーリー形式をサポート：短編、中編、長編",
              "様々なジャンルをサポート：ファンタジー、SF、ロマンス、ミステリー、アドベンチャーなど",
              "複数の視点オプション：一人称、三人称など",
              "カスタマイズ可能な対象読者と感情的トーン"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "より一貫性のあるストーリープロットのためにAI生成品質を向上",
              "より直感的なストーリー生成プロセスのためにユーザーインターフェースを改善"
            ]
          }
        ]
      },
      {
        "version": "v1.0.0",
        "date": "2025-10-10",
        "changes": [
          {
            "type": "feature",
            "items": [
              "公式ウェブサイトのローンチ",
              "基本的なページフレームワークのセットアップ完了",
              "Next.js 15と最新の技術スタックを統合",
              "ユーザー認証システムを実装（Google OAuth対応）",
              "本番環境にデプロイ"
            ]
          },
          {
            "type": "security",
            "items": [
              "セキュリティ検証メカニズムを実装",
              "HTTPSサポートを追加",
              "CSPセキュリティポリシーを設定"
            ]
          }
        ]
      }
    ]
  }
}
