{
  "changelog": {
    "name": "changelog",
    "label": "변경 로그",
    "title": "변경 로그",
    "description": "최신 기능, 개선 사항, 버그 수정 및 보안 업데이트를 확인하세요",
    "items": [
      {
        "version": "v1.3.8",
        "date": "2025-12-02",
        "changes": [
          {
            "type": "feature",
            "items": [
              "Added unified keyboard shortcut support to all main generators (Story, Plot, Poem, Fanfic, Tabbed Fanfic, Book Title) including Generate (⌘⏎ / Ctrl⏎) and Focus Input (⌘F / CtrlF)",
              "Introduced a reusable GeneratorShortcutHints component to display available shortcuts consistently below the primary generate buttons",
              "Enabled auto-save draft support for the main input fields across all core generators (Story, Plot, Poem, Fanfic, Tabbed Fanfic, Book Title), persisting drafts to localStorage per locale and restoring them automatically after refresh or navigation"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "Refined generator button labels to keep them clean while surfacing keyboard shortcuts in a dedicated hint area for better discoverability"
            ]
          }
        ]
      },
      {
        "version": "v1.3.7",
        "date": "2025-12-01",
        "changes": [
          {
            "type": "feature",
            "items": [
              "시 생성기에 스토리 저장 기능을 추가하고, 생성 완료 가이드와 스토리 저장 다이얼로그를 통합했습니다",
              "커뮤니티 페이지(Story Square)에 이야기 출처별로 탐색할 수 있는 소스 카테고리 필터 태그를 추가했습니다 (story, fanfic, plot, poem)",
              "커뮤니티용 Story Square 페이지를 새로 추가하여 공개된 AI 스토리를 한곳에서 둘러볼 수 있도록 했습니다",
              "사용자 콘솔에 “My Stories(나의 스토리)” 페이지를 추가하여 저장된 작품을 한곳에서 관리할 수 있도록 했습니다",
              "창작 현황(Creation Overview) 대시보드를 추가하여 전체 스토리 수, 단어 수, 창작 일수, 연속 기록을 한눈에 확인할 수 있게 했습니다"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "플롯 생성기의 Save Story 안내 레이아웃을 조정하여, 저장 관련 콘텐츠가 별도의 한 줄에 표시되도록 하고 전체 레이아웃이 덜 답답하게 보이도록 개선했습니다",
              "Story Square 소스 카테고리 필터에 대해, 지원되는 모든 인터페이스 언어에서 일관된 다국어 라벨을 제공하도록 보완했습니다"
            ]
          },
          {
            "type": "fix",
            "items": [
              "시 생성기 출력 영역의 JSX 구조 문제로 인해 발생하던 빌드 및 런타임 오류를 수정했습니다",
              "Next.js 15 Route Handler 타입 검사로 인해 스토리 관련 API 라우트 빌드가 실패하던 문제를, 동적 API 라우트의 context 타입을 완화하는 방식으로 해결했습니다"
            ]
          }
        ]
      },
      {
        "version": "v1.3.6",
        "date": "2025-11-29",
        "changes": [
          {
            "type": "feature",
            "items": [
              "NextAuth 기반 통합 로그인 시스템을 도입하여 향후 계정 기능과 개인화 기능을 위한 기반을 마련했습니다"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "헤더 내비게이션을 단순화하여 독립적인 \"Features\" 탭을 제거하고 AI 글쓰기 진입점으로 통합했습니다"
            ]
          }
        ]
      },
      {
        "version": "v1.3.5",
        "date": "2025-11-28",
        "changes": [
          {
            "type": "feature",
            "items": [
              "처음 사용하는 사용자가 기능과 다음 단계를 더 빠르게 이해할 수 있도록 새로운 온보딩 플로우와 생성 완료 후 가이드를 추가했습니다"
            ]
          },
          {
            "type": "fix",
            "items": [
              "Get Started 섹션 앵커가 올바른 위치로 스크롤되지 않던 문제를 수정했습니다"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "전체 사이트 로딩 성능을 한층 더 최적화하여 첫 화면 표시 시간을 단축했습니다",
              "로딩 진행률 표시를 다듬어 더 부드럽고 정확한 피드백을 제공합니다",
              "AI Writing Tools 모듈의 성능과 인터랙션 디테일을 개선했습니다",
              "불필요한 단계를 줄여 사람 인증 플로우를 단순화하고 사용 흐름을 향상시켰습니다",
              "현재 디자인 시스템에 맞게 Hero 및 Header 영역 스타일을 다듬어 시각적 일관성을 높였습니다"
            ]
          }
        ]
      },
      {
        "version": "v1.3.4",
        "date": "2025-11-23",
        "changes": [
          {
            "type": "feature",
            "items": [
              "변경 로그 모듈에 러시아어 현지화가 추가되었습니다"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "사이트 전반의 스타일을 다듬어 일관된 비주얼을 유지했습니다",
              "다크 모드 표시 품질을 개선해 가독성을 높였습니다",
              "주요 UI 구성 요소의 다크 모드 가시성을 더욱 강화했습니다"
            ]
          }
        ]
      },
      {
        "version": "v1.3.3",
        "date": "2025-11-19",
        "changes": [
          {
            "type": "feature",
            "items": [
              "포괄적인 AI 라이팅 툴킷을 갖춘 AI 라이팅 툴 모듈 추가",
              "국제화 커버리지를 확장하는 러시아어 지원 추가"
            ]
          },
          {
            "type": "fix",
            "items": [
              "북타이틀 다국어 생성 실패 문제 수정",
              "시스템 안정성 향상을 위한 여러 알림 관련 문제 수정",
              "페이지 네비게이션 경험 향상을 위한 라우팅 문제 수정"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "사용자 경험 향상을 위한 페이지 접근성 최적화",
              "더 나은 모니터링과 알림 기능으로 알림 시스템 강화"
            ]
          }
        ]
      },
      {
        "version": "v1.3.2",
        "date": "2025-11-15",
        "changes": [
          {
            "type": "feature",
            "items": [
              "현대적인 호버 애니메이션과 상호작용을 갖춘 빵부스러기 내비게이션 컴포넌트 추가",
              "시 생성기를 전역 내비게이션 구조와 사이트맵에 통합"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "직관적인 빵부스러기 내비게이션으로 시 생성기 사용자 경험 향상",
              "시 생성기의 적절한 인덱싱과 검색 우선순위를 위해 사이트맵 SEO 최적화",
              "헤더와 푸터에 시 생성기 액세스 포인트를 추가하여 랜딩 페이지 내비게이션 업데이트"
            ]
          }
        ]
      },
      {
        "version": "v1.3.1",
        "date": "2025-11-15",
        "changes": [
          {
            "type": "feature",
            "items": [
              "다양한 시 유형(하이쿠, 소네트, 아크로스틱, 연애시 등)을 지원하는 포괄적인 AI 시 생성기 추가",
              "AI 기반 문학 분석과 피드백을 갖춘 시 분석 API 구현",
              "광범위한 사용자 정의 옵션을 갖춘 이중 모드 인터페이스(단순/고급) 생성",
              "로컬 저장소와 드롭다운 인터페이스를 갖춘 시 기록 관리 시스템 추가",
              "시 생성기를 메인 내비게이션과 사이트 구조에 통합"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "5개 언어(영어, 중국어, 일본어, 한국어, 독일어)에서 완전한 국제화 지원 구현",
              "코드 유지보수성 향상을 위한 포괄적인 TypeScript 타입 정의 추가",
              "시 생성기를 위한 광범위한 마케팅 자산과 SEO 최적화 생성",
              "모드 토글 기능과 고급 사용자 정의 옵션으로 UI 향상"
            ]
          }
        ]
      },
      {
        "version": "v1.3.0",
        "date": "2025-11-08",
        "changes": [
          {
            "type": "feature",
            "items": [
              "AI 기반 스토리 아웃라인 생성 기능을 갖춘 포괄적인 플롯 생성기 기능 추가",
              "쉬운 발견을 위해 플롯 생성기를 메인 내비게이션과 사이트맵에 통합",
              "5개 언어(영어, 중국어, 일본어, 한국어, 독일어)로 플롯 생성기 다국어 지원 구현",
              "AI 플롯 생성기 롱테일 키워드 통합으로 SEO 최적화 강화",
              "사용자 경험 향상을 위해 플롯 생성기 페이지에 빵부스크럼 탐색 추가"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "검색 엔진 가시성 향상을 위해 플롯 생성기 메타데이터 최적화",
              "헤더와 풋터의 AI 쓰기 섹션에 플롯 생성기를 추가하여 내비게이션 일관성 강화",
              "설득력 있는 마케팅 카피와 전문적인 프레젠테이션으로 플롯 생성기 UI 개선",
              "지원되는 모든 언어에서 창의적 영감을 위한 포괄적인 랜덤 프롬프트 라이브러리 추가"
            ]
          }
        ]
      },
      {
        "version": "v1.2.5",
        "date": "2025-11-03",
        "changes": [
          {
            "type": "feature",
            "items": [
              "팬픽 생성기에 5개 언어 지원 다국어 출력 옵션 추가",
              "즉시 영감을 제공하는 688줄 프리셋 작품 라이브러리로 팬픽 기능 대폭 향상",
              "더 나은 사용자 탐색을 위한 빵부crumbs 탐색 구성 요소 도입",
              "향상된 성능과 오류 처리가 포함된 강화된 팬픽 생성 API",
              "코드 유지 관리를 강화하기 위한 포괄적인 TypeScript 유형 정의 추가"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "개선된 리소스 관리로 랜딩 페이지 로딩 성능 최적화",
              "더 나은 시각적 일관성을 위해 FAQ2 컴포넌트의 다크 모드 표시 문제 수정",
              "팬픽 컴포넌트의 스타일 및 상호작용 논리 강화",
              "여러 컴포넌트의 사용자 인터페이스 개선"
            ]
          },
          {
            "type": "fix",
            "items": [
              "팬픽 무엇 컴포넌트의 제목 스타일 문제 수정",
              "더 깔끔한 코드베이스를 위한 중복 컴포넌트 코드 제거"
            ]
          }
        ]
      },
      {
        "version": "v1.2.4",
        "date": "2025-11-01",
        "changes": [
          {
            "type": "improvement",
            "items": [
              "팬픽 스토리 생성기 인터페이스 개선, 더 나은 시각적 경험과 레이아웃 정렬을 위해 스타일 최적화",
              "5개 언어(중국어, 영어, 일본어, 한국어, 독일어)로 팬픽 컴포넌트에 완전한 국제화 지원 추가",
              "고급 옵션 및 생성 탭의 하드코딩된 중국어 텍스트 문제 수정",
              "더 나은 사용자 상호작용을 위한 새로운 팝오버 UI 컴포넌트 도입",
              "단계 탭 컴포넌트의 스타일 및 상호작용 논리 개선",
              "스마트 추천 컴포넌트 강화로 추천 정확도 향상"
            ]
          },
          {
            "type": "feature",
            "items": [
              "코드 유지 관리를 개선하기 위해 팬픽 생성 컴포넌트에 포괄적인 TypeScript 유형 정의 추가",
              "모든 스타일 조정 세부사항을 기록하는 FANFIC_WIDTH_ALIGNMENT_REPORT.md 문서 생성"
            ]
          }
        ]
      },
      {
        "version": "v1.2.3",
        "date": "2025-10-25",
        "changes": [
          {
            "type": "feature",
            "items": [
              "사용자 정의 가능한 장르, 톤, 스타일 옵션을 갖춘 AI 기반 책 제목 생성기 추가",
              "5개 언어(영어, 중국어, 일본어, 한국어, 독일어)에 대한 완전한 국제화 지원 구현",
              "현대적 UI 디자인과 사용자 경험을 갖춘 전용 책 제목 생성기 페이지 생성",
              "다중 매개변수와 SEO 최적화를 포함하는 포괄적인 제목 생성 API 추가",
              "쉬운 발견을 위해 책 제목 생성기를 메인 내비게이션과 사이트맵에 통합"
            ]
          }
        ]
      },
      {
        "version": "v1.2.2",
        "date": "2025-10-25",
        "changes": [
          {
            "type": "feature",
            "items": [
              "스토리 생성기에 독립적인 출력 언어 선택 기능 추가",
              "12개 주요 언어 지원: 영어, 중국어, 일본어, 한국어, 스페인어, 프랑스어, 독일어, 포르투갈어, 러시아어, 아랍어, 힌디어, 이탈리아어",
              "언어 선택기가 \"빠른 추가\" 섹션 아래에 위치하며 직관적인 이모티콘과 이중 언어 표시 제공",
              "사용자가 웹사이트 인터페이스와 다른 스토리 출력 언어 선택 가능",
              "모든 인터페이스 텍스트를 포함하는 완전한 다국어 번역 지원"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "새로운 outputLanguage 필드로 API 매개변수 전달 최적화",
              "클로저 문제를 피하기 위한 상태 관리 개선",
              "TypeScript 유형 정의 확장을 통한 유형 안전성 강화",
              "기존 디자인 시스템과의 일관성 유지"
            ]
          }
        ]
      },
      {
        "version": "v1.2.1",
        "date": "2025-10-20",
        "changes": [
          {
            "type": "fix",
            "items": [
              "잘못된 라우터를 사용하여 언어 상태가 손실되는 언어 전환기 문제 수정",
              "언어 전환 컴포넌트가 이제 next-intl의 i18n 인식 라우터를 사용하여 언어 전환 후 링크를 클릭해도 언어 상태가 유지되도록 함"
            ]
          }
        ]
      },
      {
        "version": "v1.2.0",
        "date": "2025-10-18",
        "changes": [
          {
            "type": "feature",
            "items": [
              "AI 생성 스토리 예제를 표시하는 스토리 쇼케이스 페이지 추가",
              "완전한 다국어 지원 구현 (중국어, 영어, 일본어, 한국어, 독일어)",
              "타임라인 스타일 표시, 버전 추적, 업데이트 분류(기능/수정/개선/보안), 다국어 지원을 포함한 완전한 변경 로그 모듈을 추가하고 Footer 및 Sitemap에 항목 추가"
            ]
          },
          {
            "type": "fix",
            "items": [
              "언어 전환 후 일부 페이지가 영어로 남아있는 문제 수정",
              "스토리 상세 페이지의 UI 텍스트 국제화 수정"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "정적 생성으로 페이지 로딩 성능 개선",
              "모바일 반응형 레이아웃 경험 향상"
            ]
          }
        ]
      },
      {
        "version": "v1.1.0",
        "date": "2025-10-15",
        "changes": [
          {
            "type": "feature",
            "items": [
              "핵심 AI 스토리 생성 기능 출시",
              "다양한 스토리 형식 지원: 단편, 중편, 장편",
              "다양한 장르 지원: 판타지, SF, 로맨스, 미스터리, 모험 등",
              "다양한 서술 관점 옵션: 1인칭, 3인칭 등",
              "사용자 정의 가능한 대상 독자 및 감정 톤"
            ]
          },
          {
            "type": "improvement",
            "items": [
              "더 일관된 스토리 플롯을 위한 AI 생성 품질 향상",
              "더 직관적인 스토리 생성 프로세스를 위한 사용자 인터페이스 개선"
            ]
          }
        ]
      },
      {
        "version": "v1.0.0",
        "date": "2025-10-10",
        "changes": [
          {
            "type": "feature",
            "items": [
              "공식 웹사이트 출시",
              "기본 페이지 프레임워크 설정 완료",
              "Next.js 15 및 최신 기술 스택 통합",
              "사용자 인증 시스템 구현 (Google OAuth 지원)",
              "프로덕션 환경에 배포"
            ]
          },
          {
            "type": "security",
            "items": [
              "보안 검증 메커니즘 구현",
              "HTTPS 지원 추가",
              "CSP 보안 정책 구성"
            ]
          }
        ]
      }
    ]
  }
}
